tests/Fixtures/Saloon/Quotes/create-order-from-quote/create-a-quote.json

{
    "statusCode": 201,
    "headers": {
        "Date": "Thu, 18 Jun 2026 13:57:25 GMT",
        "Content-Type": "application\/json",
        "Content-Length": "1487",
        "Connection": "keep-alive",
        "x-ratelimit-remaining-minute": "929",
        "ratelimit-limit": "1000",
        "ratelimit-remaining": "929",
        "ratelimit-reset": "35",
        "x-ratelimit-limit-minute": "1000",
        "etag": "42620d5b5da2af3684ad73e44397504a",
        "Cache-Control": "no-store",
        "pragma": "no-cache",
        "vary": "Origin",
        "access-control-allow-origin": "https:\/\/office.bexio.com",
        "via": "1.1 google",
        "cf-cache-status": "DYNAMIC",
        "Server": "cloudflare",
        "CF-RAY": "a0dacd924fba576e-ZRH"
    },
    "data": "{\"id\":105,\"document_nr\":\"AN-00105\",\"title\":\"Test Quote\",\"contact_id\":1,\"contact_sub_id\":null,\"user_id\":1,\"project_id\":null,\"logopaper_id\":1,\"language_id\":1,\"bank_account_id\":1,\"currency_id\":1,\"payment_type_id\":1,\"header\":\"Guten Tag bexio AG<br\\\/><br\\\/>Danke f\\u00fcr Ihr Interesse. Sie erhalten folgendes Angebot:\",\"footer\":\"Sie haben Fragen? Melden Sie sich bei uns.<br\\\/><br\\\/>Freundliche Gr\\u00fcsse<br\\\/>Mustermann Maxmilian\",\"total_gross\":\"100\",\"total_net\":\"100\",\"total_taxes\":\"0.0000\",\"total\":\"100\",\"total_rounding_difference\":0,\"mwst_type\":1,\"mwst_is_net\":true,\"show_position_taxes\":true,\"is_valid_from\":\"2026-06-18\",\"is_valid_until\":\"2026-06-23\",\"contact_address\":\"bexio AG\\nAlte Jonastrasse 24\\n8640 Rapperswil\\nUpdated Country Name\",\"delivery_address_type\":0,\"delivery_address\":\"bexio AG\\nAlte Jonastrasse 24\\n8640 Rapperswil\\nUpdated Country Name\",\"kb_item_status_id\":1,\"api_reference\":\"188368ad-d562-4c0a-87a6-71ddadeb2ab1\",\"viewed_by_client_at\":null,\"kb_terms_of_payment_template_id\":null,\"show_total\":true,\"updated_at\":\"2026-06-18 15:57:25\",\"template_slug\":\"\",\"taxs\":[],\"positions\":[{\"id\":325,\"type\":\"KbPositionCustom\",\"amount\":\"1\",\"amount_reserved\":null,\"amount_open\":null,\"amount_completed\":null,\"unit_id\":1,\"account_id\":95,\"unit_name\":\"Stk\",\"tax_id\":14,\"tax_value\":\"8.10\",\"text\":\"835ffbe9-b39b-41b1-a8e6-dc2c072009d1\",\"unit_price\":\"100\",\"discount_in_percent\":\"0\",\"position_total\":\"100\",\"pos\":\"1\",\"internal_pos\":1,\"parent_id\":null,\"is_optional\":false}],\"network_link\":\"\"}",
    "context": []
}