tests/Fixtures/Saloon/Quotes/issue-a-quote/create-a-quote.json

{
    "statusCode": 201,
    "headers": {
        "Date": "Fri, 28 Nov 2025 09:16:46 GMT",
        "Content-Type": "application\/json",
        "Content-Length": "1454",
        "Connection": "keep-alive",
        "CF-RAY": "9a58c4b75e232397-ZRH",
        "ratelimit-remaining": "997",
        "ratelimit-reset": "14",
        "x-ratelimit-limit-minute": "1000",
        "x-ratelimit-remaining-minute": "997",
        "ratelimit-limit": "1000",
        "etag": "93c3d7f96c6e18ac63066b319e28f9ad",
        "Cache-Control": "no-store",
        "pragma": "no-cache",
        "vary": "Origin",
        "access-control-allow-origin": "https:\/\/office.bexio.com",
        "via": "1.1 google",
        "cf-cache-status": "DYNAMIC",
        "Server": "cloudflare"
    },
    "data": "{\"id\":22,\"document_nr\":\"AN-00022\",\"title\":\"Test Quote\",\"contact_id\":1,\"contact_sub_id\":null,\"user_id\":1,\"project_id\":null,\"logopaper_id\":1,\"language_id\":1,\"bank_account_id\":1,\"currency_id\":1,\"payment_type_id\":1,\"header\":\"Guten Tag bexio AG<br\\\/><br\\\/>Danke f\\u00fcr Ihr Interesse. Sie erhalten folgendes Angebot:\",\"footer\":\"Sie haben Fragen? Melden Sie sich bei uns.<br\\\/><br\\\/>Freundliche Gr\\u00fcsse<br\\\/>Max Mustermann\",\"total_gross\":\"100\",\"total_net\":\"100\",\"total_taxes\":\"0.0000\",\"total\":\"100\",\"total_rounding_difference\":0,\"mwst_type\":1,\"mwst_is_net\":true,\"show_position_taxes\":true,\"is_valid_from\":\"2025-11-28\",\"is_valid_until\":\"2025-12-03\",\"contact_address\":\"bexio AG\\nAlte Jonastrasse 24\\n8640 Rapperswil\\nSchweiz\",\"delivery_address_type\":0,\"delivery_address\":\"bexio AG\\nAlte Jonastrasse 24\\n8640 Rapperswil\\nSchweiz\",\"kb_item_status_id\":1,\"api_reference\":\"ba66d6b1-31c7-4091-ab18-d15cdd742c6a\",\"viewed_by_client_at\":null,\"kb_terms_of_payment_template_id\":null,\"show_total\":true,\"updated_at\":\"2025-11-28 10:16:46\",\"template_slug\":\"\",\"taxs\":[],\"positions\":[{\"id\":23,\"type\":\"KbPositionCustom\",\"amount\":\"1\",\"amount_reserved\":null,\"amount_open\":null,\"amount_completed\":null,\"unit_id\":1,\"account_id\":217,\"unit_name\":\"Stk\",\"tax_id\":14,\"tax_value\":\"8.10\",\"text\":\"2a2f974d-cd9b-4e01-9d9b-41c0bdd89f38\",\"unit_price\":\"100\",\"discount_in_percent\":\"0\",\"position_total\":\"100\",\"pos\":\"1\",\"internal_pos\":1,\"parent_id\":null,\"is_optional\":false}],\"network_link\":\"\"}",
    "context": []
}