tests/Fixtures/Saloon/Quotes/revert-issue-a-quote/fetch-a-quote.json

{
    "statusCode": 200,
    "headers": {
        "Date": "Fri, 28 Nov 2025 09:33:31 GMT",
        "Content-Type": "application\/json",
        "Content-Length": "1519",
        "Connection": "keep-alive",
        "CF-RAY": "9a58dd3e8f6e7dd2-ZRH",
        "ratelimit-reset": "29",
        "x-ratelimit-limit-minute": "1000",
        "x-ratelimit-remaining-minute": "999",
        "ratelimit-limit": "1000",
        "ratelimit-remaining": "999",
        "etag": "8a8e1bdf907993920fa38057067a8348",
        "Cache-Control": "no-store",
        "pragma": "no-cache",
        "vary": "Origin",
        "access-control-allow-origin": "https:\/\/office.bexio.com",
        "via": "1.1 google",
        "cf-cache-status": "DYNAMIC",
        "Server": "cloudflare"
    },
    "data": "{\"id\":39,\"document_nr\":\"AN-00039\",\"title\":\"Test Quote\",\"contact_id\":1,\"contact_sub_id\":null,\"user_id\":1,\"project_id\":null,\"logopaper_id\":1,\"language_id\":1,\"bank_account_id\":1,\"currency_id\":1,\"payment_type_id\":1,\"header\":\"Guten Tag bexio AG<br\\\/><br\\\/>Danke f\\u00fcr Ihr Interesse. Sie erhalten folgendes Angebot:\",\"footer\":\"Sie haben Fragen? Melden Sie sich bei uns.<br\\\/><br\\\/>Freundliche Gr\\u00fcsse<br\\\/>Max Mustermann\",\"total_gross\":\"100.000000\",\"total_net\":\"100.000000\",\"total_taxes\":\"0.0000\",\"total\":\"100.000000\",\"total_rounding_difference\":0,\"mwst_type\":1,\"mwst_is_net\":true,\"show_position_taxes\":true,\"is_valid_from\":\"2025-11-28\",\"is_valid_until\":\"2025-12-03\",\"contact_address\":\"bexio AG\\nAlte Jonastrasse 24\\n8640 Rapperswil\\nSchweiz\",\"delivery_address_type\":0,\"delivery_address\":\"bexio AG\\nAlte Jonastrasse 24\\n8640 Rapperswil\\nSchweiz\",\"kb_item_status_id\":1,\"api_reference\":\"7d038610-bce2-4294-8346-be7b65a6857e\",\"viewed_by_client_at\":null,\"kb_terms_of_payment_template_id\":null,\"show_total\":true,\"updated_at\":\"2025-11-28 10:32:54\",\"template_slug\":\"\",\"taxs\":[],\"positions\":[{\"id\":40,\"type\":\"KbPositionCustom\",\"amount\":\"1.000000\",\"amount_reserved\":\"0.000000\",\"amount_open\":\"0.000000\",\"amount_completed\":\"0.000000\",\"unit_id\":1,\"account_id\":217,\"unit_name\":\"Stk\",\"tax_id\":14,\"tax_value\":\"8.10\",\"text\":\"9f2aa10c-19d4-425c-9ef4-3a5a7263f887\",\"unit_price\":\"100.000000\",\"discount_in_percent\":\"0.0000\",\"position_total\":\"100.000000\",\"pos\":\"1\",\"internal_pos\":1,\"parent_id\":null,\"is_optional\":false}],\"network_link\":\"\"}",
    "context": []
}